package pom;

public class MainPageDescription {

    // Лого Яндекс в шапке
    //*[@id="root"]/div/div/div[1]/div[1]/a[1]/img

    // Лого Самокат в шапке
    //*[@id="root"]/div/div/div[1]/div[1]/a[2]/img

    // Кнопка согласия с куки
    //*[@id="rcc-confirm-button"]

    // Кнопка "Заказать" вверху страницы
    //button[text()='Заказать'])[1]

    // Кнопка "Заказать" внизу страницы
    //button[text()='Заказать'])[2]

    // Кнопки выпадающего списка в блоке Вопросы о важном
    //*[contains(text(), "Текст вопроса")]

    // Выпадающий ответ при нажатии на кнопку в блоке Вопросы о важном
    //*[not(@hidden) and contains(text(), "Текст ответа")]
}
